## Trevor Arellanes
## Fundamentals of Data Analytics
## Task 4 - SQL

## Import modules, connect to the dtabase

In [43]:
import sqlite3 # import needed library

## 4. import sqlite3 module and use connect function to create connection to database

In [44]:
connection = sqlite3.connect('books.db')

## importing pandas

In [45]:
import pandas as pd

In [46]:
pd.options.display.max_columns = 10

## Display DataFrame of authors table

In [47]:
pd.read_sql('SELECT * FROM authors', connection, index_col=['id']) # makes data frame use ID as base indice

        first    last
id
1        Paul  Deitel
2      Harvey  Deitel
3       Abbey  Deitel
4         Dan   Quirk
5   Alexander    Wald

## Display DataFrame of titles table

In [48]:
pd.read_sql('SELECT * FROM titles', connection) # viewing the titles tables contents

         isbn                             title  edition copyright
0  0135404673     Intro to Python for CS and DS        1      2020
1  0132151006     Internet & WWW How to Program        5      2012
2  0134743350               Java How to Program       11      2018
3  0133976890                  C How to Program        8      2016
4  0133406954  Visual Basic 2012 How to Program        6      2014
5  0134601548          Visual C# How to Program        6      2017
6  0136151574         Visual C++ How to Program        2      2008
7  0134448235                C++ How to Program       10      2017
8  0134444302            Android How to Program        3      2017
9  0134289366         Android 6 for Programmers        3      2016

## Display DATAframe of author_isbn table

In [49]:
df = pd.read_sql('SELECT * FROM author_ISBN', connection) # uses author ID and ISBN number to display table

df.head() # shows first 5 entries

   id        isbn
0   1  0134289366
1   2  0134289366
2   5  0134289366
3   1  0135404673
4   2  0135404673

## 17.2.2. SELECT
### Display DataFrame with only authors first and last columns from authors table

In [50]:
pd.read_sql('SELECT first, last FROM authors', connection)

       first    last
0       Paul  Deitel
1     Harvey  Deitel
2      Abbey  Deitel
3        Dan   Quirk
4  Alexander    Wald

## Section 17.2.3 WHERE
### Display DataFrame with columsn of title, edition and copyright of books with copyright greater than 2016

In [51]:
pd.read_sql("""SELECT title, edition, copyright 
            FROM titles
            WHERE copyright > '2016'""", connection) # Shows use of Where clause speceifies a query's selection criteria

                           title  edition copyright
0  Intro to Python for CS and DS        1      2020
1            Java How to Program       11      2018
2       Visual C# How to Program        6      2017
3             C++ How to Program       10      2017
4         Android How to Program        3      2017

## Display Dataframe with columns id, last and first that contains al lauthors whose last name starts with D

In [52]:
pd.read_sql("""SELECT id, first, last FROM authors WHERE last LIKE 'D%'""", connection, index_col=['id'])

     first    last
id
1     Paul  Deitel
2   Harvey  Deitel
3    Abbey  Deitel

## Display dataframe with columns id, first and last that contains all authors whose last name starts with any character, followed by the letter b, followed by any additional character

In [53]:
pd.read_sql("""Select id, first, last FROM authors WHERE first LIKE '_b%'""", connection, index_col=['id'])

    first    last
id
3   Abbey  Deitel

## Section 17.2.4 Order By Clause

### Display dataframe with title column, sorted in ascending order

In [54]:
pd.read_sql('SELECT title FROM titles ORDER BY title ASC', connection) # sorts data in ascending order using order by clause

                              title
0         Android 6 for Programmers
1            Android How to Program
2                  C How to Program
3                C++ How to Program
4     Internet & WWW How to Program
5     Intro to Python for CS and DS
6               Java How to Program
7  Visual Basic 2012 How to Program
8          Visual C# How to Program
9         Visual C++ How to Program

## Sorting by multiple columns

### Display columns id, first, last; all sorted by last name, then by first name for authors with the same last name

In [55]:
pd.read_sql("""SELECT id, first, last FROM authors Order BY last, first""", connection, index_col=['id'])

        first    last
id
3       Abbey  Deitel
2      Harvey  Deitel
1        Paul  Deitel
4         Dan   Quirk
5   Alexander    Wald

## Display sorted in descending order by last name and ascending order by first name for authors with the ame last name

In [56]:
pd.read_sql("""SELECT id, first, last
                FROM authors
                ORDER BY last DESC, first ASC""",
                connection, index_col=['id'])

        first    last
id
5   Alexander    Wald
4         Dan   Quirk
3       Abbey  Deitel
2      Harvey  Deitel
1        Paul  Deitel

## Combine WHERE and ORDER BY

### Display columns isbn, title eidtion and copyright; show books with title ending with "How to Program" sorted in ascending order by title

In [57]:
pd.read_sql("""SELECT isbn, title, edition, copyright 
                FROM titles
                WHERE title LIKE '%How to Program'
                ORDER BY title""", connection)

         isbn                             title  edition copyright
0  0134444302            Android How to Program        3      2017
1  0133976890                  C How to Program        8      2016
2  0134448235                C++ How to Program       10      2017
3  0132151006     Internet & WWW How to Program        5      2012
4  0134743350               Java How to Program       11      2018
5  0133406954  Visual Basic 2012 How to Program        6      2014
6  0134601548          Visual C# How to Program        6      2017
7  0136151574         Visual C++ How to Program        2      2008

## 17.2.5 INNER JOIN

### Display head of data fram contianing authors with ISBNs for books written by each author

In [58]:
pd.read_sql("""SELECT first, last, isbn
            FROM authors
            INNER JOIN author_ISBN
                ON authors.id=author_ISBN.id
            ORDER BY last, first""",connection).head()

    first    last        isbn
0   Abbey  Deitel  0132151006
1   Abbey  Deitel  0133406954
2  Harvey  Deitel  0134289366
3  Harvey  Deitel  0135404673
4  Harvey  Deitel  0132151006

## 17.2.6 INSERT INTO Statement

### Call the connection cursor method

In [59]:
cursor = connection.cursor()

### Insert new author named Sue Red into the authors table by calling Cursor method execute

In [60]:
cursor = cursor.execute("""INSERT INTO authors (first, last) VALUES ('Sue', 'Red')""")

### Display authors table to confirm new addition

In [61]:
pd.read_sql('SELECT id, first, last FROM authors',
            connection, index_col=['id'] )

        first    last
id
1        Paul  Deitel
2      Harvey  Deitel
3       Abbey  Deitel
4         Dan   Quirk
5   Alexander    Wald
6         Sue     Red

## Section 17.2.7 Update

### Change Sue Red's last name to Black by modifying the authors table

In [62]:
curusor = cursor.execute("""UPDATE authors SET last='Black' 
                    WHERE last = 'Red' AND first='Sue'""" )

### Use rowcount to confirm the number of rows modified

In [63]:
cursor.rowcount

1

### Confirm modification by displaying dataframe of authors table

In [64]:
pd.read_sql('SELECT id, first, last FROM authors', 
            connection, index_col=['id'])

        first    last
id
1        Paul  Deitel
2      Harvey  Deitel
3       Abbey  Deitel
4         Dan   Quirk
5   Alexander    Wald
6         Sue   Black

## Section 17.2.8 DELETE FROM

### Remove Sue Black from authors table using her author ID

In [65]:
cursor = cursor.execute('DELETE FROM authors WHERE id=6')

### confirm removal by displaying dataframe of authors table

In [66]:
pd.read_sql('SELECT id, first, last FROM authors',
            connection, index_col=['id'])

        first    last
id
1        Paul  Deitel
2      Harvey  Deitel
3       Abbey  Deitel
4         Dan   Quirk
5   Alexander    Wald

### Display Result of 3 tables

### authors table

In [67]:
pd.read_sql('SELECT * FROM authors', connection, index_col=['id'])

        first    last
id
1        Paul  Deitel
2      Harvey  Deitel
3       Abbey  Deitel
4         Dan   Quirk
5   Alexander    Wald

### titles table

In [68]:
pd.read_sql('SELECT * FROM titles', connection)

         isbn                             title  edition copyright
0  0135404673     Intro to Python for CS and DS        1      2020
1  0132151006     Internet & WWW How to Program        5      2012
2  0134743350               Java How to Program       11      2018
3  0133976890                  C How to Program        8      2016
4  0133406954  Visual Basic 2012 How to Program        6      2014
5  0134601548          Visual C# How to Program        6      2017
6  0136151574         Visual C++ How to Program        2      2008
7  0134448235                C++ How to Program       10      2017
8  0134444302            Android How to Program        3      2017
9  0134289366         Android 6 for Programmers        3      2016

### authors_ISBN table

In [69]:
pd.read_sql('SELECT * FROM author_ISBN', connection)

    id        isbn
0    1  0134289366
1    2  0134289366
2    5  0134289366
3    1  0135404673
4    2  0135404673
5    1  0132151006
6    2  0132151006
7    3  0132151006
8    1  0134743350
9    2  0134743350
10   1  0133976890
11   2  0133976890
12   1  0133406954
13   2  0133406954
14   3  0133406954
15   1  0134601548
16   2  0134601548
17   1  0136151574
18   2  0136151574
19   4  0136151574
20   1  0134448235
21   2  0134448235
22   1  0134444302
23   2  0134444302

## Disconnect from database when no longer needed

In [70]:
connection.close()